for i in [0, 1, 2, 3, 4]: 
    print("대기번호 : {0}".format(i))
'''
대기번호 : 0
대기번호 : 1
대기번호 : 2
대기번호 : 3
대기번호 : 4
'''
for i in range(5): 
    print("대기번호 : {0}".format(i))
'''
대기번호 : 0
대기번호 : 1
대기번호 : 2
대기번호 : 3
대기번호 : 4
'''
for i in range(1, 6): 
    print("대기번호 : {0}".format(i))
'''
대기번호 : 1
대기번호 : 2
대기번호 : 3
대기번호 : 4
대기번호 : 5
'''
starbucks = ["아이언맨", "토르", "아이엠 그루트"]
for customer in starbucks:
    print("{0}, 커피가 준비되었습니다.".format(customer))
'''
아이언맨, 커피가 준비되었습니다.
토르, 커피가 준비되었습니다.
아이엠 그루트, 커피가 준비되었습니다.
'''